In [54]:
import pandas as pd

In [57]:
#Diğer klasörde olan Titanic.csv'yi kullandım. Eğer hata alıyorsanız, .csv dosyanız ile kod dosyanızı aynı yere kaydedip okuma
#yapabilirsiniz.
import os
 
dirpath = os.getcwd()
foldername = os.path.basename(dirpath)
scriptpath = os.path.realpath("Titanic Dataset Feature Engineering\Titanic.csv")

In [58]:
data= pd.read_csv(scriptpath)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Sex sütunu

In [60]:
data= pd.read_csv(scriptpath, usecols=["Sex"])
data.head()

      Sex
0    male
1  female
2  female
3  female
4    male

Makine öğrenmesi algoritmalarını çalıştırabilmek için kategorik verileri(string) nümerik verilere dönüştürmemiz gerekiyor. Bunun için one hot encoding kavramı devreye giriyor.

LabelEncoder ile kategorilerin hepsine sayı değeri veriliyor. Female=1 Male=0 gibi. Daha sonra OneHotEncoder ile bunları dummy değişkenler haline getiriyor. 1>0 için kadın, erkekten üstün gibi bir anlam çıkabilir. Bunu engellemek için dummy değişkenler oluşturuluyor. Yani kategorik değerlerimizin birbirine hiyerarşik üstünlüğü yok.

Biz LabelEncoder yerine get_dummies() metodu ile yapacağız.

In [61]:
pd.get_dummies(data).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [63]:
pd.concat([data,pd.get_dummies(data)],axis=1).head()

      Sex  Sex_female  Sex_male
0    male           0         1
1  female           1         0
2  female           1         0
3  female           1         0
4    male           0         1

In [64]:
pd.get_dummies(data,drop_first=True).head()  #dummy değişken tuzağı -dummy variable trap

   Sex_male
0         1
1         0
2         0
3         0
4         1

### Embarked sütunu

In [65]:
data= pd.read_csv(scriptpath, usecols=["Embarked"])
data.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [66]:
data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [68]:
data.Embarked.isnull().sum()  # Embarked sütununda null değerlerin toplamı

2

In [69]:
pd.get_dummies(data).head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [70]:
pd.get_dummies(data,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [71]:
pd.get_dummies(data,drop_first=True,dummy_na=True).head()  # Nan değerlerinin karşılığında 1 yazacak, dolu olan değerler için 0

   Embarked_Q  Embarked_S  Embarked_nan
0           0           1             0
1           0           0             0
2           0           1             0
3           0           1             0
4           0           1             0

In [72]:
pd.get_dummies(data,drop_first=True,dummy_na=True).sum(axis=0)

Embarked_Q       77
Embarked_S      644
Embarked_nan      2
dtype: int64

In [73]:
pd.get_dummies(data,dummy_na=True).sum(axis=0)

Embarked_C      168
Embarked_Q       77
Embarked_S      644
Embarked_nan      2
dtype: int64

### Cabin sütunu

In [74]:
data= pd.read_csv(scriptpath, usecols=["Cabin"])
data.head()

  Cabin
0   NaN
1   C85
2   NaN
3  C123
4   NaN

In [75]:
data.Cabin.nunique()   #147 tane değişik kategori var.

147

In [76]:
cabin_one=pd.get_dummies(data)
cabin_one.head()

,Cabin_A10,Cabin_A14,Cabin_A16,Cabin_A19,Cabin_A20,Cabin_A23,Cabin_A24,Cabin_A26,Cabin_A31,Cabin_A32,...,Cabin_E8,Cabin_F E69,Cabin_F G63,Cabin_F G73,Cabin_F2,Cabin_F33,Cabin_F38,Cabin_F4,Cabin_G6,Cabin_T
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

Çok fazla kategorik verilerin bulunduğu veri setlerinde ne yapılmalı ? Curse of dimensionality